Revit 2027 API
ParameterTypeId.LayoutnodeCurvetypeParam Property
 "Curve Type Reference"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LayoutnodeCurvetypeParam { get; }
Public Shared ReadOnly Property LayoutnodeCurvetypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LayoutnodeCurvetypeParam {
	ForgeTypeId^ get ();
}
static member LayoutnodeCurvetypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace